In [1]:
import pandas as pd
import numpy as np


items = {'Bob':pd.Series(data=[245, 25, 55],index=['bike', 'pants', 'watch']),
        'Alice':pd.Series(data=[40, 110, 500, 45],index=['book', 'glasses', 'bike', 'pants'])}

# Check type of items
type(items)

dict

In [93]:
# Creating dataFrame from dictionary
pd.DataFrame(items)

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [5]:
# Creating a dataframe without mentioning the index in pandas series
names = pd.Series(data=['Asad','Hamza','Saqib','Manzoor'])
df = pd.DataFrame(names,columns=['Names'])
df

     Names
0     Asad
1    Hamza
2    Saqib
3  Manzoor

In [7]:
# Adding second column to the above dataframe
col_roll = pd.DataFrame(data=[9124,8975,8988,2432])
df['Roll_No'] = col_roll
df

     Names  Roll_No
0     Asad     9124
1    Hamza     8975
2    Saqib     8988
3  Manzoor     2432

In [8]:
# We can add a second column simply like below without creating a second dataframe
df['Roll_No'] = [9124,8975,8988,2432]
df

     Names  Roll_No
0     Asad     9124
1    Hamza     8975
2    Saqib     8988
3  Manzoor     2432

In [20]:
# Select only a single column by it's name
%timeit pd.DataFrame(df,columns=['Names'])

346 µs ± 4.7 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [22]:
# We can access a column by it's name simply like below without accessing through dataframe method but this one will take 
# Than dataframe method means dataframe method is more efficient then accessing directly by indexing.
%timeit df[["Names"]]

600 µs ± 3.95 µs per loop (mean ± std. dev. of 7 runs, 1,000 loops each)

In [97]:
# Select only two rows from the dataframe above
two_rows = pd.DataFrame(df,index=[0,1])
two_rows

   Names  Roll_No
0   Asad     9124
1  Hamza     8975

In [35]:
# Select last columns and show all rows
last_column = pd.DataFrame(df,columns=['Roll_No'])
df

     Names  Roll_No
0     Asad     9124
1    Hamza     8975
2    Saqib     8988
3  Manzoor     2432

In [47]:
# We can also access a specific column by using the dot notation
df.Names

0       Asad
1      Hamza
2      Saqib
3    Manzoor
Name: Names, dtype: object

In [56]:
# Creating a dataframe with labels and column names
vegetable = [{'Potato':150},{'Tomato':240},{'Onion':900},{'Cocumber':50}]
veg_menu = pd.DataFrame(vegetable,index=['Label1','Label2','Label3','Label4'])
veg_menu

        Potato  Tomato  Onion  Cocumber
Label1   150.0     NaN    NaN       NaN
Label2     NaN   240.0    NaN       NaN
Label3     NaN     NaN  900.0       NaN
Label4     NaN     NaN    NaN      50.0

In [67]:
# Select first two column and all rows
pd.DataFrame(veg_menu,columns=['Potato','Tomato'])

        Potato  Tomato
Label1   150.0     NaN
Label2     NaN   240.0
Label3     NaN     NaN
Label4     NaN     NaN

In [68]:
# We can do the above using this trick but again dataframe may look long tidier but it's more time saviour than the below method
veg_menu[['Potato','Tomato']]

        Potato  Tomato
Label1   150.0     NaN
Label2     NaN   240.0
Label3     NaN     NaN
Label4     NaN     NaN

In [69]:
# Accessing rows by it's labels
pd.DataFrame(veg_menu,index=['Label3','Label2'])
veg_menu

        Potato  Tomato  Onion  Cocumber
Label1   150.0     NaN    NaN       NaN
Label2     NaN   240.0    NaN       NaN
Label3     NaN     NaN  900.0       NaN
Label4     NaN     NaN    NaN      50.0

In [83]:
# Accessing row by it's index unlike above
veg_menu.iloc[[0,2]]

        Potato  Tomato  Onion  Cocumber
Label1   150.0     NaN    NaN       NaN
Label3     NaN     NaN  900.0       NaN

<h2 style='color:yellow;'> Accessing Elements in Pandas DataFrames</h2>
<hr style='background-color:green;height:3px;'></hr>

In [84]:
items = [{'bikes':20,'watches':35,'pants':30},
               {'glasses':50,'pants':5,'watches':10,'bikes':15}]
store_items = pd.DataFrame(items,index=['Dic1','Dic2'])

In [85]:
# We use double brackets because DataFrames are 2-Dimensional unlike Panda Series which is 1-Dimensional
store_items[['bikes']]

      bikes
Dic1     20
Dic2     15

In [86]:
# Accessing multiple columns from a dataframe
store_items[['bikes','watches']]

      bikes  watches
Dic1     20       35
Dic2     15       10

In [87]:
# Accessing a row using index label
store_items.loc[['Dic1']]

      bikes  watches  pants  glasses
Dic1     20       35     30      NaN

In [90]:
# We can also access a row using dataframe method
pd.DataFrame(data=store_items,index=['Dic2'])

      bikes  watches  pants  glasses
Dic2     15       10      5     50.0

In [106]:
store_items

      bikes  watches  pants  glasses
Dic1     20       35     30      NaN
Dic2     15       10      5     50.0

In [92]:
# Accessing value at a specific row and column like above we want only '35' value 
# It's important to provide column name first and then the row if we do the opposite then this will through an error.
thirty_five = store_items['watches']['Dic1']
thirty_five

35

In [108]:
# We can do the above using dataframe method as well
thirty_five = pd.DataFrame(store_items,index=['Dic1'],columns=['watches'],)

# The only difference the above and this method is that above will return the numpy integer while this one return 'DataFrame'
thirty_five.ndim

2

In [112]:
store_items

      bikes  watches  pants  glasses  suit  shirt
Dic1     20       35     30      NaN    45     15
Dic2     15       10      5     50.0     7      2

In [113]:
# Adding 'shirt' column to store_items dataframe
store_items['shirt'] = [15,2]
store_items

      bikes  watches  pants  glasses  suit  shirt
Dic1     20       35     30      NaN    45     15
Dic2     15       10      5     50.0     7      2

In [114]:
# Adding 'suit' column to a dataframe using sum of 2 column's values
store_items['suit'] = store_items['pants'] + store_items['shirt']
store_items

      bikes  watches  pants  glasses  suit  shirt
Dic1     20       35     30      NaN    45     15
Dic2     15       10      5     50.0     7      2

In [117]:
# Adding row to the above DataFrame 
# First we have to create a dataframe then we will append it to the original dataframe
Dic3 = pd.DataFrame(data={'bikes':34,'watches':55,'glasses':3,'shirt':9},index=['Dic3'])
Dic3

      bikes  watches  glasses  shirt
Dic3     34       55        3      9

In [118]:
# store_items.append(Dic3)
# The above method is deprecated and will be removed from pandas in a future version instead we will be using 'pandas.concat'

# We can use the 'loc' method or 'iloc' (integer location)
# store_items.loc['Dic3'] = {'bikes':34,'watches':55,'glasses':3,'shirt':9}


# Using the 'pandas.concat' method to append a row to a dataframe
pd.concat([store_items,Dic3],)

      bikes  watches  pants  glasses  suit  shirt
Dic1     20       35   30.0      NaN  45.0     15
Dic2     15       10    5.0     50.0   7.0      2
Dic3     34       55    NaN      3.0   NaN      9

In [123]:
# Adding existing values in a dataframe to a new column name 'new_suit'
store_items['new_suit'] = store_items['suit'][1:]
store_items

      bikes  watches  pants  glasses  suit  shirt  new_suit
Dic1     20       35     30      NaN    45     15       NaN
Dic2     15       10      5     50.0     7      2       7.0

In [115]:
# Insert a new column before the 'pants' column
# If a column insert once and we run the same cell twice then it will gives us the error of already exist column.

store_items.insert(2,column='shoes',value=[33,22])
store_items

      bikes  watches  shoes  pants  glasses  shirt  suit  new_suit
Dic1     20       35     33     30      NaN     15    45       NaN
Dic2     15       10     22      5     50.0      2     7       7.0

In [116]:
# Droping row one from dataframe
store_items.drop(labels='Dic1')

      bikes  watches  shoes  pants  glasses  shirt  suit  new_suit
Dic2     15       10     22      5     50.0      2     7       7.0

In [117]:
store_items

      bikes  watches  shoes  pants  glasses  shirt  suit  new_suit
Dic1     20       35     33     30      NaN     15    45       NaN
Dic2     15       10     22      5     50.0      2     7       7.0

In [118]:
# now removing 'new_suit' column from dataframe using pop method which is used only for columns 
store_items.pop('new_suit')
store_items

      bikes  watches  shoes  pants  glasses  shirt  suit
Dic1     20       35     33     30      NaN     15    45
Dic2     15       10     22      5     50.0      2     7

In [124]:
# Rename column name of a dataframe
store_items.rename(columns={'bikes':'Cars','shirt':'shilwar'})

      Cars  watches  pants  glasses  suit  shilwar  new_suit
Dic1    20       35     30      NaN    45       15       NaN
Dic2    15       10      5     50.0     7        2       7.0

In [123]:
# Rename row name of a dataframe
store_items.rename(index={'Dic1':'Row1','Dic2':'Row2'})

      bikes  watches  shoes  pants  glasses  shirt  suit
Row1     20       35     33     30      NaN     15    45
Row2     15       10     22      5     50.0      2     7